 #Область ПрограмныйИнтерфейс  

//// Создаем акты выполненных работ по договору "Абонентское обслуживание"
//// Возвращаемое значение - массив записей

Функция СоздатьАктыПоДоговорамАбонентскойПлаты(Период, ДатаАктов) Экспорт  
	
	Если Не ЗначениеЗаполнено(Период) Тогда  
		ОбщегоНазначения.СообщитьПользователю("Не выбран период "); 
		Возврат Неопределено;
	КонецЕсли;
	
	// Ищем все договора "Абонентское обслуживание" и  Реа-ции, которые уже созданы, по этим же договорам. 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора < &ДатаАкта
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора > &ДатаАкта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаКонец
	|	И РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Дата КАК Дата,
	|	ВТ_Реализации.Ссылка КАК Реализация,
	|	ВТ_Договоры.Ссылка КАК Договор,
	|	ВТ_Договоры.Организация КАК Организация,
	|	ВТ_Договоры.Владелец КАК Контрагент,
	|	ВТ_Договоры.ВидДоговора КАК ВидДоговора,
	|	ВТ_Договоры.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	|	ВТ_Договоры.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_Договоры.Владелец = ВТ_Реализации.Контрагент";
	
	
	Запрос.УстановитьПараметр("ДатаАкта", ДатаАктов);	
	Запрос.УстановитьПараметр("ДатаНачало", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонец", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	//И по этим договорам создаем и заполняем Акты 
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	СозданныеАкты = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		
		// Если реализация создана, то перезаписываем её
		Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
			ДокументРеализация = Выборка.Реализация.ПолучитьОбъект() 
			
			// Если реализация ещё не создана, то создаём	 
		Иначе
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументРеализация.Дата = ДатаАктов;
		КонецЕсли;
		
		ДокументРеализация.Организация = Выборка.Организация;
		ДокументРеализация.Контрагент = Выборка.Контрагент;
		ДокументРеализация.Договор = Выборка.Договор;
		ДокументРеализация.ВКМ_ЗаполнитьНаСервере();
		
		ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		
		Запись = Новый Структура;
		Запись.Вставить("Ссылка", ДокументРеализация.Ссылка);
		Запись.Вставить("Договор", ДокументРеализация.Договор);
		СозданныеАкты.Добавить(Запись); 	 
		
		
	КонецЦикла;
	
	Возврат ?(ЗначениеЗаполнено(СозданныеАкты) , СозданныеАкты, Неопределено);	
	
	
КонецФункции

#КонецОбласти
