#Область ОбработчикиСобытий 

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата; 
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	
КонецПроцедуры  

Процедура ЗаполнитьТабличнуюЧасть() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ПериодОстатков, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	
	Запрос.УстановитьПараметр("ПериодОстатков", Новый Граница(КонецМесяца(Дата),ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выгрузить(); 
	
	Выплаты.Загрузить(Выборка);
	
	
КонецПроцедуры

#КонецОбласти