
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьКоличествоДнейВОтпуске()
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	РассчитатьКоличествоДнейВОтпуске() 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении1(Элемент)
	
	РассчитатьКоличествоДнейВОтпуске() 
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда) 
	
	Адрес = ОткрытьАнализГрафикаНаСервере();
	
	Если ЗначениеЗаполнено(Объект.Год) Тогда   
		
		СтруктураПараметры = Новый Структура("АдресХранилища, Год", Адрес, Объект.Год); 
		
	Иначе ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран год отпусков");   
		
	КонецЕсли;  
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", СтруктураПараметры);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьКоличествоДнейВОтпуске() 
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
	
	ТекущиеДанные.ДнейВОтпуске = ДеньГода(ТекущиеДанные.ДатаОкончания) - ДеньГода(ТекущиеДанные.ДатаНачала);
	
КонецПроцедуры

&НаСервере
Функция ОткрытьАнализГрафикаНаСервере()
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
КонецФункции

#КонецОбласти




