//{ Левшина ВКМ_Диплом 

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина; 
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	КонецЕсли;
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь; 
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь; 
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_НачалоДействияДоговора",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Начало действия договора";
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_ОкончаниеДействияДоговора",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Окончание действия договора";
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Сумма абонентской платы";
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Стоимость часа работы"; 
	
КонецПроцедуры
 //{ Левшина ВКМ_Диплом 



